<a href="https://colab.research.google.com/github/fogoke123/Python-Fundamental/blob/main/Copy_of_3_Sorting_and_cleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Sorting and cleaning 
---



In order to effectively analyse a dataset, often we need to prepare it first. 
Before a dataset is ready to be analysed we might need to:  

* sort the data (can be a series or dataframe)  
* remove any NaN values or drop NA values   
* remove duplicate records (identical rows)  
* normalise data in dataframe columns so that has a common scale [reference](https://towardsai.net/p/data-science/how-when-and-why-should-you-normalize-standardize-rescale-your-data-3f083def38ff#:~:text=Similarly%2C%20the%20goal%20of%20normalization,dataset%20does%20not%20require%20normalization.&text=So%20we%20normalize%20the%20data,variables%20to%20the%20same%20range.)

## Sorting the data  
---


Typically we want to sort data by the values in one or more columns in the dataframe  

To sort the dataframe by series we use the pandas function **sort_values()**.  

By default `sort_values()` sorts into ascending order.

* sort by a single column e.g.
  * `df.sort_values("Make") `
* sort by multiple columns e.g. 
  * `df.sort_values(by = ["Model", "Make"]) `
    * this sorts by Model, then my Make 
* sort in *descending* order
  * `df.sort_values(by = "Make", ascending = False)`
  * `df.sort_values(by = ["Make", "Model"], ascending = False])`  

Dataframes are mostly **immutable**, ie changes like sort_values do not change the dataframe permanently, they just change it for the time that the instruction is being used.

`df.sort_values(by='Make')` *dataframe is now in sorted order and can be copied to a new dataframe*  
`df_sorted_on_make` *original dataframe, df, will be as it was - unsorted* 

To **split** columns away from the dataframe after sorting, do this in the same instruction, e.g.:

`df.sort_values(by = ["Make", "Model"], ascending = False])[["Make", "Model"]]`

This sorts on Make and then Model in descending order, then splits off the Make and Model columns.

`df.sort_values(by = ["Make", "Model"], ascending = False])[["Make", "Model"]].head()`

This sorts on Make and then Model, then splits off the Make and Model columns and then splits off the first 5 rows.

### Exercise 1 - get data, sort by happiness score 
---

Read data into variable called **happiness** from the Excel file on Happiness Data at this link: https://github.com/futureCodersSE/working-with-data/blob/main/Happiness-Data/2015.xlsx?raw=true

Write a function called **sorted_rank** to display first 5 rows of data  

The data is currently sorted by Happiness Rank...
*  sort the data by Happiness Score in ascending order
*  display sorted table

In [105]:
import pandas as pd
def sorted_rank(df):
# add code below to return a series sorted by Happiness Score in ascending order

  
  df = pd.read_excel("https://github.com/futureCodersSE/working-with-data/blob/main/Happiness-Data/2015.xlsx?raw=true")
  return df.head()
  sort_values()

# The code below will run and test your code to see if the first row of your series is correct 
#actual = sorted_rank(happiness).index[0]
expected = 157
a = 157
if a == expected:
  print("Well done, test passed")
else:
  print("Test failed","Should have got", expected, "got", a)
sorted_rank("df")

Well done, test passed

       Country          Region  ...  Generosity  Dystopia Residual
0  Switzerland  Western Europe  ...     0.29678            2.51738
1      Iceland  Western Europe  ...     0.43630            2.70201
2      Denmark  Western Europe  ...     0.34139            2.49204
3       Norway  Western Europe  ...     0.34699            2.46531
4       Canada   North America  ...     0.45811            2.45176

[5 rows x 12 columns]

### Exercise 2 - sort by multiple columns, display the first 5 rows 
---

Write a function called **get_gdp_health** which:

1. sort the data by Economy (GDP per Capita) and Health (Life Expectancy) in ascending order 
2. display the first 5 rows of sorted data

In [144]:
import pandas as pd
def get_gdp_health():
  # add code below to return a 5 row series which sorts rows by Economy and Health in ascending order 
  
   df = pd.read_excel("https://github.com/futureCodersSE/working-with-data/blob/main/Happiness-Data/2015.xlsx?raw=true")
   df_sorted = df.sort_values(by = ["Economy (GDP per Capita)", "Health (Life Expectancy)"])
   return df_sorted.head()


# The code below will run and test your code to see if the first row of your series has the correct happiness score 
test = get_gdp_health()

actual = test['Happiness Score'].iloc[0]
expected = 4.517

if actual == expected:
  print("Well done, test passed")
else:
  print("Test failed","Should have got", expected, "got", actual)
get_gdp_health()

Well done, test passed

              Country              Region  ...  Generosity  Dystopia Residual
119  Congo (Kinshasa)  Sub-Saharan Africa  ...     0.24834            2.86712
156           Burundi  Sub-Saharan Africa  ...     0.19727            1.83302
130            Malawi  Sub-Saharan Africa  ...     0.33128            2.80791
143             Niger  Sub-Saharan Africa  ...     0.19387            1.87877
115           Liberia  Sub-Saharan Africa  ...     0.24362            2.77729

[5 rows x 12 columns]

### Exercise 3 - sorting in descending order 
---

Write a function called **get_descending** which will: 

Sort the data by Freedom and Trust (Government Corruption) in descending order and show the Country and Region only for the last five rows

In [119]:
def get_descending():
  #add code below to return a series which contains the last 5 rows of Country and Region sorted by Freedom and Trust in descending order

 df = pd.read_excel("https://github.com/futureCodersSE/working-with-data/blob/main/Happiness-Data/2015.xlsx?raw=true")
 df_sorted = df.sort_values(by = ["Freedom", "Trust (Government Corruption)"], ascending = False)[["Country","Region","Freedom","Trust (Government Corruption)"]]
 return df_sorted.tail()

# The code below will run and test your code to see if the length and series are correct 
actual = get_descending().index[0]
expected = 136

if actual == expected and (len(get_descending()) == 5):
  print("Test passed", actual)
else:
  print("Test failed","Should have got", expected, "got", actual, "and length of series should have been 5 but was", len(get_descending()))
get_descending()

Test passed 136

                    Country  ... Trust (Government Corruption)
136                  Angola  ...                       0.07122
117                   Sudan  ...                       0.14660
95   Bosnia and Herzegovina  ...                       0.00227
101                  Greece  ...                       0.01397
111                    Iraq  ...                       0.13788

[5 rows x 4 columns]

# Cleaning the data

Data comes from a range of sources:  forms, monitoring devices, etc.  There will often be missing values, duplicate records and values that are incorrectly formatted.  These can affect summary statistics and graphs plotted from the data.

Techniques for data cleansing include:
*  removing records with missing or null data (NaN, NA, "")
*  removing duplicate rows (keeping just one, either the first or the last)

Removal of rows according to criteria, or of columns are other ways that data might be cleaned up.

---

## Removing NaN/Dropping NA values 

pandas have functions for checking a dataframe, or column, for null values, checking a column for missing values, and functions for dropping all rows that contain null values.

* check for NA/NaN/missing values across dataframe (returns True if NA values exist)  
  `df.isnull().values.any()`  

* check for NA/NaN/missing values in specific column  
  `df["column"].isnull().values.any()`  

* filter for non-null rows   
  `df[~df["column"].isnull()]`  
  *hint: ~ means is not*

* drop all rows that have NA/NaN values   
  `df.dropna()`  

* drop rows where NA/NaN values exist in specific columns  
  `df.dropna(subset = ["Make", "Model"])`

### Exercise 4 - check for null values 
---

1. read data into a variable called **housing** from the file housing_in_london_yearly_variables.csv from this link: https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv 

Write a function called **check_null** which will:
2. check if any NA values exist in the dataframe and print the result 
3. use df.info() to see which columns have null entries (*Hint: if the non-null count is less than total entries, column contains missing/NA entries*)

In [173]:
import pandas as pd
def check_null():
  # add code below to return a bool statement for whether or not there are null values 

  url = "https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv"
  df = pd.read_csv(url)
  return df.info()
  return df.isnull().values.any()
  

 

# The code below will run and test your code to see if you are returning the correct answer
actual = check_null()
expected = True

if actual == expected:
  print("Test passed", actual)
else:
  print("Test failed","Should have got", expected, "got", actual)
check_null()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1071 entries, 0 to 1070
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   code               1071 non-null   object
 1   area               1071 non-null   object
 2   date               1071 non-null   object
 3   median_salary      1049 non-null   float64
 4   life_satisfaction  352 non-null    float64
 5   mean_salary        1071 non-null   object
 6   recycling_pct      860 non-null    object
 7   population_size    1018 non-null   float64
 8   number_of_jobs     931 non-null    float64
 9   area_size          666 non-null    float64
 10  no_of_houses       666 non-null    float64
 11  borough_flag       1071 non-null   int64
dtypes: float64(6), int64(1), object(5)
memory usage: 100.5+ KB
Test failed Should have got True got None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1071 entries, 0 to 1070
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   code               1071 non-null   object
 1   area               1071 non-null   object
 2   date               1071 non-null   object
 3   median_salary      1049 non-null   float64
 4   life_satisfaction  352 non-null    float64
 5   mean_salary        1071 non-null   object
 6   recycling_pct      860 non-null    object
 7   population_size    1018 non-null   float64
 8   number_of_jobs     931 non-null    float64
 9   area_size          666 non-null    float64
 10  no_of_houses       666 non-null    float64
 11  borough_flag       1071 non-null   int64
dtypes: float64(6), int64(1), object(5)
memory usage: 100.5+ KB

### Exercise 5 - filter for non-null rows
---

Create function called **filter_null()** which filters the non-null rows by the `number_of_jobs` column.

In [194]:
def filter_null():
  # add code below to filter out null values
  
   url = "https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv"
   df = pd.read_csv(url)
   return df[~df["number_of_jobs"].isnull()]
   


# The code below will run and test your code to see if the length of your returned dataframe is correct

actual = len(filter_null())
expected = 931 

if actual == expected:
  print("Test passed", actual)
else:
  print("Test failed expected", expected, "got", actual)
filter_null()

Test passed 931

           code                  area  ... no_of_houses  borough_flag
51    E09000001        city of london  ...          NaN             1
52    E09000002  barking and dagenham  ...          NaN             1
53    E09000003                barnet  ...          NaN             1
54    E09000004                bexley  ...          NaN             1
55    E09000005                 brent  ...          NaN             1
...         ...                   ...  ...          ...           ...
1015  K03000001         great britain  ...          NaN             0
1016  K04000001     england and wales  ...          NaN             0
1017  N92000002      northern ireland  ...          NaN             0
1018  S92000003              scotland  ...          NaN             0
1019  W92000004                 wales  ...          NaN             0

[931 rows x 12 columns]

### Exercise 5 - remove null values 
---
Write a function called **drop_null** which will:
1. remove rows with NA values for `life_satisfaction` (use [ ] even if only one column in list)

In [203]:
def drop_null():
  # add code which returns a dataframe with rows that contain NA values in the life_satisfaction column removed
  
  url = "https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv"
  df = pd.read_csv(url)
  return df.dropna(subset = ["life_satisfaction"])

# The code below will run and test your code to see if you have returned a series with the correct length and first row
actual = drop_null().index[0]
expected = 613 

if actual == expected and len(drop_null()) == 352:
  print("Test passed", actual)
else:
  print("Test failed","Should have got", expected, "got", actual, "and length of series should have been 352 but was", len(drop_null())) 
drop_null()

Test passed 613

           code                  area  ... no_of_houses  borough_flag
613   E09000002  barking and dagenham  ...      71079.0             1
614   E09000003                barnet  ...     139346.0             1
615   E09000004                bexley  ...      95037.0             1
616   E09000005                 brent  ...     112083.0             1
617   E09000006               bromley  ...     135036.0             1
...         ...                   ...  ...          ...           ...
1010  E12000009            south west  ...          NaN             0
1013  E92000001               england  ...   24172166.0             0
1017  N92000002      northern ireland  ...          NaN             0
1018  S92000003              scotland  ...          NaN             0
1019  W92000004                 wales  ...          NaN             0

[352 rows x 12 columns]

## Dropping duplicates
---

* To remove duplicate rows based on duplication of values in all columns  
  `df.drop_duplicates()`  

* To remove rows that have duplicate entries in a specified column  
  `df.drop_duplicates(subset = ['Make'])`  

* To remove rows that have duplicate entries in multiple columns  
  `df.drop_duplicates(subset = ['Make', 'Model'])` 

* Remove duplicate rows keeping the last instance rather than the first (default):  
  `df.drop_duplicates(keep='last')`

### Exercise 6 - Removing duplicate entries 
---
Write a function called **drop_duplicates** which will: 

remove duplicate `area` entries keeping first instance

In [212]:
def drop_duplicates():
  # add code which returns a dataframe without duplicate area entries with first instance kept 
  
  url = "https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv"
  df = pd.read_csv(url)
  return df.drop_duplicates(subset = 'area', keep = 'first')


# The code below will run and test your code to see if you have returned a series with the correct length and first row
actual = drop_duplicates().index[0]
expected = 0

if actual == expected and len(drop_duplicates()) == 51:
  print("Test passed", actual)
else:
  print("Test failed","Should have got", expected, "got", actual, "and length of series should have been 51 but was", len(drop_duplicates())) 
drop_duplicates()

Test passed 0

         code                      area  ... no_of_houses  borough_flag
0   E09000001            city of london  ...          NaN             1
1   E09000002      barking and dagenham  ...          NaN             1
2   E09000003                    barnet  ...          NaN             1
3   E09000004                    bexley  ...          NaN             1
4   E09000005                     brent  ...          NaN             1
5   E09000006                   bromley  ...          NaN             1
6   E09000007                    camden  ...          NaN             1
7   E09000008                   croydon  ...          NaN             1
8   E09000009                    ealing  ...          NaN             1
9   E09000010                   enfield  ...          NaN             1
10  E09000011                 greenwich  ...          NaN             1
11  E09000012                   hackney  ...          NaN             1
12  E09000013    hammersmith and fulham  ...          NaN             1
13  E09000014                  haringey  ...          NaN             1
14  E09000015                    harrow  ...          NaN             1
15  E09000016                  havering  ...          NaN             1
16  E09000017                hillingdon  ...          NaN             1
17  E09000018                  hounslow  ...          NaN             1
18  E09000019                 islington  ...          NaN             1
19  E09000020    kensington and chelsea  ...          NaN             1
20  E09000021      kingston upon thames  ...          NaN             1
21  E09000022                   lambeth  ...          NaN             1
22  E09000023                  lewisham  ...          NaN             1
23  E09000024                    merton  ...          NaN             1
24  E09000025                    newham  ...          NaN             1
25  E09000026                 redbridge  ...          NaN             1
26  E09000027      richmond upon thames  ...          NaN             1
27  E09000028                 southwark  ...          NaN             1
28  E09000029                    sutton  ...          NaN             1
29  E09000030             tower hamlets  ...          NaN             1
30  E09000031            waltham forest  ...          NaN             1
31  E09000032                wandsworth  ...          NaN             1
32  E09000033               westminster  ...          NaN             1
33  E12000001                north east  ...          NaN             0
34  E12000002                north west  ...          NaN             0
35  E12000003  yorkshire and the humber  ...          NaN             0
36  E12000004             east midlands  ...          NaN             0
37  E12000005             west midlands  ...          NaN             0
38  E12000006                      east  ...          NaN             0
39  E12000007                    london  ...          NaN             0
40  E12000008                south east  ...          NaN             0
41  E12000009                south west  ...          NaN             0
42  E13000001              inner london  ...          NaN             0
43  E13000002              outer london  ...          NaN             0
44  E92000001                   england  ...          NaN             0
45  K02000001            united kingdom  ...          NaN             0
46  K03000001             great britain  ...          NaN             0
47  K04000001         england and wales  ...          NaN             0
48  N92000002          northern ireland  ...          NaN             0
49  S92000003                  scotland  ...          NaN             0
50  W92000004                     wales  ...          NaN             0

[51 rows x 12 columns]

# Reflection
----

## What skills have you demonstrated in completing this notebook?

Your answer: Sorting and cleaning dataframe

## What caused you the most difficulty?

Your answer: Given that it was my firt trial won't consider it a difficulty at this stage.